[Language]
Code="km"
Name="Khmer (Cambodia)"
Version="2.6.3"
Translator="Sovichet Tep <sovichet.tep@gmail.com>"
Translator-Khmer="ទេព សុវិចិត្រ <sovichet.tep@gmail.com>"
Dir="ltr"

[MainFrame]
Title="Lingoes"
Close="បិទ"
Maximize="Maximize"
Minimize="Minimize"
Restore="ស្ដារ​មក​វិញ"
Menu="ម៉ឺនុយ​ដំបូង"

; Status Icon
[NotifyIcon]
Tip="Lingoes\nCapture Word on Screen: [$CursorStatus]\nTranslate Selected Text: [$SelectionStatus]\nTranslate Clipboard Text: [$ClipboardStatus]"
InfoTitle="Lingoes"
Info="Capture Word on Screen: [$CursorStatus]\nTranslate Selected Text: [$SelectionStatus]\nTranslate Clipboard Text: [$ClipboardStatus]"
Enabled="បាន​អនុញ្ញាត"
Disabled="មិន​បាន​អនុញ្ញាត"

[MainMenu]
Open="បើក"
CursorTranslator="ចាប់​យក​ពាក្យ​នៅ​លើ​អេក្រង់"
SelectionTranslator="បក​ប្រែ​ពាក្យ​ដែល​បាន​រើស"
ClipboardTranslator="Translate Clipboard Text"
Configuration="ការ​កំណត់​រូប​សណ្ឋាន..."
Dictionaries="វចនានុ​ក្រម..."
Appendices="Appendices..."
Activation="ការ​ដំនើរ​ការ​ផលិត​ផល"
UpdateOnline="អាប់​ដេត​តាម​បណ្ដាញ"
Help="ជំនួយ"
About="អំពី Lingoes"
SupportOnline="គាំ​ទ្រ​លើ​បណ្ដាញ"
Exit="ចាក​ចេញ"
EnterLicense="បញ្ជូល​អាជ្ញា​បណ្ណ័..."

[DlgInput]
Back="ត្រឡប់​ក្រោយ"
Forward="ទៅ​មុខ"
MainMenu="ម៉ឺ​នុយ​ដើម"
HistoryList="បញ្ជី​ប្រវត្តិ"
Search="ស្វែង​រក", "Search detailed explanations"
WebSearch="ស្វែង​រក​តាម​វែប"
AutoMatch="Auto Match", "Auto Match At Index Group"
MatchSetup="Index Group Option..."
FindEngine="Get more web engines..."

[DlgIndex]
Index="Index"
Guide="Guide"
Appendix="Appendix"
NoIndex="No Index"
AddIndexGroup="<div style=\"margin: 10; font-family: '[$TextFont]'; font-size: [$TextFontSize]pt\">Add dictionary into <b>Index Group</b>, You can get spelling suggest while input word.<br/><br/><a href=\"app://dictionary_group/[$IndexGroupID]\"><u>To manage index group, click here.</u></a></div>"

[WebGuide]
Results="លទ្ធផល"
Spelling="Spelling Alternatives"
Appendices="Appendices"
Options="ជម្រើស"
Dictionaries="វចនានុក្រម...", "គ្រប់​គ្រង​វចនា​នុក្រម"
ManageAppendices="ផ្នែកបន្ថែម...", "គ្រប់​គ្រង​ផ្នែក​បន្ថែម"
Configuration="ការកំណត់រូបសណ្ឋាន...", "បើក​ផ្ទាំងកំណត់​រូប​សណ្ឋាន"
Help="Help", "បើក​ជំនួយ Lingoes"
Homepage="lingoes.net", "Visit Lingoes Web Site"
Community="Lingoes Community", "Lingoes Online Community"

[DlgAppendix]
WndTitle="Appendices Options"
Close="Close"
Install="Install", "Lingoes Appendices (*.laf)|*.laf|", "Install Failed! \nThis may be that you have no sufficient file access permissions."
Delete="Delete", "Are you sure to delete \"[$Title]\"", "Delete \"[$Title]\" Failed! \nThis may be that you have no sufficient file access permissions."
Modify="Modify", "Modify Failed! \nThis may be that you have no sufficient file access permissions."
NewGroup="New Group", "Failure to create a new group! \nThis may be that you have no sufficient file access permissions."
MoveUp="Move Up"
MoveDown="Move Down"
CreateAppendix="Create My Appendix..."
Download="Get more Appendices..."
Name="Name"
Group="Group"
InstallSucceed="\"[$Title]\" Install Succeed."
OverwriteInstall="The appendix has existed, do you want to overwrite it?\n\nDisplay Title:[$Title]\nName: [$Name]"
InvalidInstallFile="Incorrect install file!\n[$Filename]"
AppeVersionTooOld="[$Filename]\nThe version of current appendix ([$AppeVer]) is too old, please update it.\n\nVisit Lingoes website to search the latest version?"
AppeVersionTooNew="[$Filename]\nThe version of current dictionary ([$AppeVer]) need higher version of lingoes.\n\nDownload latest version from Lingoes website now?"

[DlgAppendixEdit]
WndTitle="Modify \"[$Title]\"", "Create a new group"
Name="Name"
DisplayTitle="Disaply Title"
DisplayStyle="Display Style"
Ok="Ok"
Cancel="Cancel"

[DlgAppendixBuilder]
WndTitle="Appendix Builder"
Name="Name:  (Only a-z, 0-9, hyphen, and underscore)", "Name is need, only allow a-z, 0-9, hyphen, and underscore."
Title="Display Title:", "Title is need!"
Location="Project Folder Location:", "Failed to create folder of the project!", "lease select a available folder"
Create="Create New Project", "Successful to create the project!\n\nNow you can design the appendix freely by editing the \"index.html\" file.", "Failed to create the project!"
Build="Build", "Successful to build the appendix file!\n[$Filename]", "Failed to build the appendix file!\n[$Filename]"
Close="Close"
Tips="Tips: You can design the appendix freely by editing the \"index.html\" file after created a new project."
OverwriteProject="The project file has existed, overwrite it?"

[DlgStatus]
KeepVisible="Keep window always on top"
CursorTranslator=""
SelectionTranslator=""
ClipboardTranslator=""
OpenMiniWnd="Open/Close mini window"

[DlgView]
Speak="និយាយ", "និយាយ​ពាក្យ​ដែល​បាន​រើស"
Search="ស្វែង​រក"
Copy="ចម្លង"
Print="បោះ​ពុម្ព..."
Save="រក្សា​ទុក..."
Find="រក..."
SelectAll="រើស​ទាំង​អស់"
TextTranslate="ការ​បក​ប្រែ​អត្ថបទ", "ចូល​ប្រើ​ការ​បក​ប្រែ​អត្ថបទ"
StartPage="ទំព័រ​ចាប់​ផ្ដើម", "ទំព័រ​ចាប់​ផ្ដើម"
ShowIndex="បង្ហាញ​របារ​ចំហៀង"
HideIndex="លាក់​របារ​ចំហៀង"
SaveFilter="ឯកសារ HTML (*.htm; *.html)|*.htm;*.html|"
SpeechOption="ជម្រើស​នៃ​ការ​និយាយ..."
SelectVoice="រើស​សម្លេង"
Activation="ការ​ធ្វើ​អោយ​ដំនើរ​ការ", ""
Buy="ទិញ", "ទិញ​អាជ្ញាបណ្ណ័​អាជីវកម្មរបស់ Lingoes"

[DlgRegister]
Title="Lingoes - Commercial User Register"
FreeDownload="Lingoes is free for non-commercial purposes use.\r\nDownload free version here..."
Name="Register Name:", "Register Name is necessary"
Email="Register E-mail:", "Register E-mail address is necessary"
RegCode="Register Code:", "The register code is invalid"
Support="Customer Service"
Register="Register", "Save registration information failure"
Exit="ចាក​ចេញ"

[DlgInfo]
Title="សារ"
Ok="យល់​ព្រម"
Cancel="បោះ​បង់"
Yes="យល់​ព្រម"
No="តេ"
Retry="ម្ដង​ទៀត"
Abort="បោះ​បង់"
Ignore="បដិសេធ"

[DlgAuthentication]
Title="ភ្ជាប់​ទៅ​កាន់ "
TitleProxy="ភ្ជាប់​ម៉ាស៊ីន​បម្រើ​ប្រុក​ស៊ី "
Username="ឈ្មោះ​ប្រើ​ប្រាស់៖"
Password="ពាក្យ​សម្ងាត់៖"
Remember="ចង​ចាំ​ពាក្យ​សម្ងាត់​របស់​ខ្ញុំ"
Ok="យល់​ព្រម"
Cancel="បោះ​បង់"

[WndGrab]
Open="Search detailed explanations"
Speak="និយាយ"
Copy="ចម្លង"
TextTranslation="ការ​បក​ប្រែ​អត្ថបទ"
Back="ថយ​ក្រោយ" 
Forward="ទៅ​មុខ"
Search="Search\n  Enter:\t\tSearch\n  Ctrl + Enter:\tSearch detailed explanations\n  Shift + Enter:\tText Translation\n  Alt + Enter:\tWeb Search"
RollUp="Roll up/Restore window"
Option="ជម្រើស"
KeepVisible="Keep window always on top"
KeepSize="Keep window size"
AutoRollUp="Auto roll up", "No", "[$DelaySecond] second delay"
CloseMiniWnd="Close mini window"

[DlgDictOption]
Title="ជម្រើស​វចនានុក្រម"
NetInstall="ទាញ​យក​មក​ពី Lingoes", "ទាញ​យក​វចនានុក្រម​មក​ពី​គេ​ហទំព័រ lingoes"
Install="ដំឡើង", "ដំឡើង​វចនានុក្រម​មក​ពី​ឌីស"
Uninstall="លុប​ចេញ", "លុប​វចនានុក្រម​ចេញ"
Add="បន្ថែម", "បន្ថែម​វចនានុក្រម​មួយ​ទៅ​ក្នុង​បញ្ជី"
Remove="ដក​ចេញ", "ដក​វចនានុក្រម​នេះ​ចេញ​ពី​បញ្ជី"
Download="ទាញ​យក", "ទាញ​យក​វចនានុក្រម​នេះ សម្រាប់​ការ​ប្រើ​ប្រាស់​នៅ​ក្រៅ​បណ្ដាញ"
MoveTop="", "រុញ​ទៅ​កំពូល"
MoveUp="", "រុញ​ឡើង​លើ"
MoveDown="", "រុញ​ចុះ​ក្រោម"
MoveBottom="", "រុញ​ទៅ​បាត"
MoreDetails="", "មើល​លម្អិត​នៃ​វចនានុក្រមView dictionary details"
Close="បិទ"

Installed="វចនានុក្រម​ដែល​បាន​ដំឡើង​រួច"
Query="វចនានុក្រម​ដែល​បាន​ដំឡើង​រួច"
Index="Index Group"
Grab="Text Capture Group"

InstalledList="វចនានុក្រម​ដែល​បាន​ដំឡើង​រួច"
QueryList="វចនានុក្រម​ដែល​បាន​ដំឡើង​រួច"
IndexList="Index Group List"
GrabList="Text Capture Group List"
DictID="ID"
Online="លើ​បណ្ដាញ"

Type="ប្រភេទ"
OnlineType="ត្រូវ​ការ​អ៊ីនធើនិត"
NotLicensed="(Not Licensed <a href='app://activate/'><u>Activate</u></a> <a href='app://buy/[$ProductID]'><u>Purchase</u></a>)"

AddFilter="វចនានុក្រម Lingoes (*.ld2, *.ldp)|*.ld2;*.ldp|"
InstallDict="ដំឡើង​វចនា​នុក្រម"
Installing="កំពុងដំឡើង..."
IndexDictTooMany="Tips:\n\nAdding too many dictionaries into \"Index Group\" will slowdown the rate of matching word while type charactors in search box.\n\nSo we recommend you that add a few frequesntly-used dictionaries into \"Index Group\" only."

[DlgDictList]
Title="បន្ថែម​វចនានុក្រម"
Add="បន្ថែម"
Cancel="បោះ​បង់"
Select="រើស"
DictList="វចនានុក្រម​ដែល​បាន​ដំឡើង"
ID="ID"
Online="លើ​បណ្ដាញ"

[DlgDictInfo]
Title="ព៌តមាន​លម្អិត​ពី​វចនានុក្រម"
Close="យល់​ព្រម"

ID="ID"
MD5="MD5"
Tag="ស្លាក"
Name="ឈ្មោះ"
Version="កំណែ"
Date="កាល​បរិច្ឆេទ​បង្កើត"
Update="បាន​អាប់​ដេត​ចុង​ក្រោយ"
IndexCount="ពាក្យ​សរុប"
Language=ភាសា
MoreLanguage=ថែម​ទៀត..
DictTitle="ចំណង​ចង"
DictEdition="កំណែ"
DictDescription="ការ​អធិប្បាយ"
PubAuthor="អ្នក​និពន្ធ"
PubPress="Press"
PubEmail="អ៊ីមែល"
PubWebsite="គេហទំព័រ"
PubCopyright="រក្សា​សិទ្ធិ"
Filename="Filename"

; Install Dictionaries
[DlgDictInstall]
Title="Install Dictionary"
InstallSucceed="Successful to install dictionary \"[$DictTitle]\""
DictGroupOption="Options"
AddIndexGroup="Add To \"Index Group\""
AddIndexGroupDesc="Lingoes will search the dictionaries in index group and prompt the closest result in index bar while typing term."
AddGrabGroup="Add To \"Text Capture Group\""
AddGrabGroupDesc="Lingoes will search dictionaries in text capture group and display translation result in text capture window while capturing text."
Ok="Ok"

; Configuration
[DlgOption]
Title="Configuration"
Ok="Ok"
Cancel="Cancel"
General="General"
Appearance="Appearance"
Connection="Connection"
Speech="Speech"
Hotkey="Hotkeys"
Translate="Translation"
License="Licenses"
Capture="Text Capture"

; General
[DlgOptGeneral]
Language="ភា​សា"
UILanguage="ភាសា​ប្រើ​ប្រាស់"

WebSearch="ការ​ស្វែង​រក​តាម​រយៈវែបសាយ"
SelectWebSearch="រើស​ម៉ាស៊ីន​ស្វែង​រក​មួយ​ដើម្បី ប្រើ​ប្រាស់​ក្នុង​ការ​ស្វែង​រក​វែបសាយ"

TermHistory="ប្រវត្តិ និង Cache"
SaveHistory="ពាក្យ​ដែល​បាន​ស្វែង​រក ដែលរក្សា​ទុក​ក្នុង​ប្រវត្តិ"
ClearHistory="សម្អាត​ប្រវត្តិ"
ClearHistoryConfirmation="តើ​អ្នកប្រាកដ​ថា​ចង់​សម្អាត​ប្រវត្តិ​មែន​ទេ?"

ResultCache="Cache មូល​ដ្ឋាន​នៃ​វចនានុក្រម​លើ​បណ្ដាញ"
ClearCache="សម្អាត Cache", "តើ​អ្នក​ប្រាកដ​ថា​ចង់​សម្អាត cache មែន​ទេ?"

AutoStart="ដំនើរ​ការ Lingoes ពេល​ណា​ដែល​ខ្ញុំ​បាន​ចូល​មក​កាន់វីនដូស៍"
StartMin="លិប​ចុះ​ក្រោម ក្រោយ​ពេល​ចាប់​ផ្ដើម"

; Appearance
[DlgOptAppearance]
UserInterface="សណ្ឋាន​ប្រើ​ប្រាស់"
WindowStyle="រចនា​បថ​វីនដូ"
WindowFont="ពុម្ព​អក្សរ​វីនដូ"
WindowFontSize="ទំហំ​ពុម្ព​អក្សរ"
WindowFontSizeList="7", "8", "9", "10", "10.5", "11"
ResultDisplay="ការ​បង្ហាញ​លទ្ធផល"
TextFont="ពុម្ព​អក្សរ"
TextFontSize="ទំហំ​ពុម្ព​អក្សរ"
TextFontSizeList="7", "8", "9", "10", "10.5", "11", "12", "13", "14", "16", "18", "20", "22", "24", "26", "28", "32", "36", "48"
PhoneticFont="ពុម្ព​អក្សរ Phonetic"
CursorTranslatorBar="Text Capture Window"
FontColor="ព៌ណ​ពុម្ព​អក្សរ"
BackColor="ព៌ណ​ផ្ទៃ​ក្រោយ"
BorderColor="ព៌ណ​បន្ទាត់​ឃាំង"
Transparence="Translucent Text Capture Windows"
SampleText="Text Capture"

[Style]
0="គ្មាន"
1="រចនា​បទ​លំនាំ​ដើម"

; Translate
[DlgOptTranslate]
SupportLCMap="Support local language mapping"
InstantTranslation="ការ​បក​ប្រែ​នា​ពេល​នេះ"
TargetLanguage="ភាសា​គោល​ដៅ៖"
CurrentUserLanguage="= ភាសា​ប្រើ​ប្រាស់​នា​ពេល​នេះ"
TargetLanguage2="ប្រសិន​ជា​ភាសា​គោល​ដៅ ដូច​នឹង​ប្រភព, ដំនើរ​ការ​វា​ម្ដង​ទៀតជា៖"
NoTranslate="= មិន​មាន​ការ​បក​ប្រែ"

;--------- For Compatible 2.4.2 and older ----------------
CursorActivation="ចាប់​យក​ពាក្យ​នៅលើ​អេក្រង់"
MouseActivation="Mouse Activation Mode:"
MouseOver="Mouse-over"
LeftMouseButton="Left Mouse Button"
MiddleMouseButton="Middle Mouse Button"
RightMouseButton="Right Mouse Button"
MouseXButton1="Mouse X Button1"
MouseXButton2="Mouse X Button2"
TimeDelay="ពេល​វេលា​ពន្យារ៖"
MSEL="millisecond"
IgnoreNumber="បដិសេធ​លេខ"
IgnoreLatin="បដិសេធ​ភាសា ឡាទីន (អង់គ្លេស, បារាំង, អាល្លឺម៉ង់, អេស្ប៉ាញ, ។ល។)"
IgnoreCJK="បដិសេធ​ភាសា ចិន, ជប៉ុន និង កូរ៉េ"
IgnoreCyrillic="បដិសេធ​ភាសា សាយ​រីលីក (រ៉ូស៊ី, អ៊ុយ​ក្រែន, ប៊ុក​កា​រៀន, ‌។ល។)"
IgnoreArabic="បដិសេធ​ភាសា អារ៉ាប់, ហ៊ូប្រ៊ូ"
InstallAdobePlugin="ដំឡើង​កម្មវិធី​ជំនួយ​ឈ្មោះ Adobe Acrobat PDF Plug-in"
ZonedWord="បក​ប្រែ​ពាក្យ​ដែល​បាន​រើស"
ZonedWordFilterRule="Filter Rules for Text Selection..."
;----------- end --------------------

; Capture
[DlgOptCapture]
CursorActivation="ចាប់​ពាក្យ​នៅ​លើ​អេក្រង់"
MouseActivation="Mouse Activation Mode:"
MouseOver="Mouse-over"
LeftMouseButton="Left Mouse Button"
MiddleMouseButton="Middle Mouse Button"
RightMouseButton="Right Mouse Button"
MouseXButton1="Mouse X Button1"
MouseXButton2="Mouse X Button2"
TimeDelay="Time Delay:"
MSEL="millisecond"
MatchPhrase="Match phrase"
IgnoreNumber="បដិសេធ​លេខ"
IgnoreLatin="បដិសេធ​ភាសា ឡាទីន (អង់គ្លេស, បារាំង, អាល្លឺម៉ង់, អេស្ប៉ាញ, ។ល។)"
IgnoreCJK="បដិសេធ​ភាសា ចិន, ជប៉ុន និង កូរ៉េ"
IgnoreCyrillic="បដិសេធ​ភាសា សាយ​រីលីក (រ៉ូស៊ី, អ៊ុយ​ក្រែន, ប៊ុក​កា​រៀន, ‌។ល។)"
IgnoreArabic="បដិសេធ​ភាសា អារ៉ាប់, ហ៊ូប្រ៊ូ"
InstallAdobePlugin="ដំឡើង​កម្មវិធី​ជំនួយ​ឈ្មោះ Adobe Acrobat PDF Plug-in"
ZonedWord="បក​ប្រែ​ពាក្យ​ដែល​បាន​រើស"
ForTextSelection="For Text Selection"
ForDoubleClicking="For Double Clicking"
ZonedWordFilterRule="Filter Rules for Text Selection..."
ShowOnlyFirstResult="Show only the first search result"

; Capture - Text Selection Filter
[DlgOptTranslateZWFilter]
Title="Filter Rules for Text Selection"
ProgramFilename="Program Filename", "Program Filename (Specify all programs if empty)"
WndClassName="Window Class Name", "Window Class Name (Specify all windows if empty)"
DisableSelect="Ignore Text Selection", "Ignore Text Selection"
DisableDBLClick="Ignore Double Click", "Ignore Double Click"
Comment="មតិ", "មតិ"
Add="បន្ថែម"
Modify="កែប្រែ"
Delete="លុប", "តើ​អ្នក​ប្រាកដ​ថា លុប​វត្ថុ​នា​ពេល​នេះ​រឺ?"
Ok="យល់​ព្រម"
Cancel="បោះ​បង់"
LoadDefault="ធ្វើ​តាម​លំនាំ​ដើម​វិញ", "តើ​អ្នក​ប្រាកដថាចង់​ធ្វើ​តាមការ​កំណត់​លំនាំ​ដើម​ពី​មុន​វិញរឺ?"
Browser="...", "កម្មវិធី​រុក​រក", "កម្មវិធី (*.exe)|*.exe|"
Capture="...", "Window Class Name Capture"
AllProgram="-- គ្រប់​កម្មវិធី --"
AllWindow="-- គ្រប់​វីនដូស៍ --"

[WndClassNameCapture]
Title="Window Class Name Capture"
ProgramFilename="Program Filename"
WndClassName="Window Class Name"
Capture="Capture It From Screen"

; Speech
[DlgOptSpeech]
RPPEngine="Natural Voice Engine"
RPPEnable="ដំនើរ​ការ"
RPPVoice="សម្លេង"
RPPRebuildIndexFile="Rebuild Index File", "Rebuild the index file failed! \nThis may be that you have no sufficient file access permissions."
Engine="Text-to-Speech (TTS) Engine"
Voice="សម្លេង"
Enable="ដំនើរ​ការ"
Volume="កម្រិត​សម្លេង"
Pitch="Pitch"
Speed="ល្បឿន"
Format="ទ្រង់​ទ្រាយ", "លំនាំ​ដើម", "មិន​ទទួល​ស្គាល់​អូឌីយ៉ូ​ប្រភេទ៖ [$Format]"
RealtimePron="Real-time Pronunciation"
PronInQuery="While looking up word"
PronInCapture="While capturing word on screen"
PronInSelect="While translating selected text"
Test="សាក​ល្បង"
EnterText="សរសេរ​ពាក្យ​ចូល ហើយ​សាក​ល្បង​សម្លេង​និយាយ​នេះ"
DownloadTTS="Download voice package of Natural Voice && TTS Engine..."

; Connect
[DlgOptConnection]
ConnectSet="ការ​កំណត់​ការ​ភ្ជាប់"
DirectConnect="ការ​ភ្ជាប់​ចំៗ"
IEProxyConnect="ប្រើ​ការ​កំណត់ប្រុក​ស៊ី មក​ពី​កម្មវិធី​រុក​រក​វែបសាយ​របស់​អ្នក"
ProxyConnect="ភ្ជាប់​ដោយ​កាត់​តាម​ប្រុក​ស៊ី / ម៉ាស៊ីន​បម្រើ Firewall"
ProxyServer="ម៉ាស៊ីន​បម្រើ​ប្រុក​ស៊ី៖"
ProxyPort="ច្រក៖"
Username="ឈ្មោះ​ប្រើ​ប្រាស់៖"
Password="ពាក្យ​សម្ងាត់៖"
OnlineUpdate="អាប់​ដេត​លើ​បណ្ដាញ"
UpdateNow="អាប់​ដេត​ឥឡូវ​នេះ"
EnableUpdate="បើក​ការ​អាប់​ដេត​លើ​បណ្ដាញ"

; Hotkey
[DlgOptHotkey]
OpenMainWnd="បើក/បិទ វីន​ដូ​ដំបូង"
GrabToggleKey="បើក/បិទ ការ​ចាប់​ពាក្យ​លើ​អេក្រង់"
SelectionToggleKey="បើក/បិទ ការ​បក​ប្រែ​ពាក្យ​ដែល​បាន​រើស"
ClipboardToggleKey="បើក/បិទ ការ​បក​ប្រែ​ពាក្យ​ក្នុង Clipboard"
Pronounce="Pronounce"
CopyInterpretation="Copy content in translation"
SpeakSelectedText="និយាយ​ពាក្យ​ដែល​បាន​រើស"
StopSpeak="ឈប់​ការ​អាន"
DisableHotKey="បិទ​ដំនើរ​ការ hotkeys"
OpenMiniWnd="បើក/បិទ វីនដូ​មីនី"
RollUpMiniWnd="Roll up/Restore mini window"

[DlgExpire]
Title="Lingoes បាន​ផុត​កំណត់​ប្រើ​ប្រាស់​ហើយ"
Ok="អាប់​ដេត​ឥឡូវ​នេះ"
Cancel="ចាក​ចេញ"
NetworkSettings="ការ​កំនត់​បណ្ដាញ"
Support="Lingoes.net"
AskUpgrade="កំណែ​នា​ពេល​នេះ​បាន​ផុត​កំណត់​ប្រើ​ប្រាស់​ហើយ, អ្នក​ត្រូវ​ធ្វើ​ទំនើប​កម្ម​វា​អោយ​ទៅ​ជា​កំណែ​ថ្មីមួយ​ទៀត! \nចង់​ធ្វើ​ទំនើប​កម្ម​ទៅ​កំណែ​ថ្មី?"

[DlgAbout]
DlgTitle="អំពី Lingoes"
; Version="កំណែ៖ "
PortableEdition="កំណែ Portable"
Email="អាសយ​ដ្ឋាន​អ៊ីមែល"
Website="គេហទំព័រ Lingoes"
LicenseTo="ផលិត​ផល​នេះ​គឺ​មាន​សិទ្ធិ​ប្រើ​ប្រាស់​ចំពោះ៖"
; LicenseID="ID៖ "

;----------- new --------
PersonalUser="ប្រើ​ប្រាស់​ផ្ទាល់​ខ្លួន ដោយ​មិន​មែន​ជា​អាជីវកម្ម"
EvaluationUser="This trial software is intended for evaluation purposes only"
UserLicenseQuantity="[$Quantity] User License", "[$Quantity] User License ([$KeyNo]/[$Quantity])"
LicenseExpire="អាជ្ញា​បណ្ណ័​ផុត​កំណត់​ក្រោយ​ក្នុង​រយៈ​ពេល [$Day] ថ្ងៃ​ទៀត"
;----------- end -----------

[WebResult]
SpellingAlternatives="Spelling Alternatives"
SpellChecker="ឧបករណ៍​ពិនិត្យ​ការ​ប្រកប"
TextTranslation="ការ​បក​ប្រែ​អត្ថបទ"
WebSearch="ស្វែង​រក​តាមវែបសាយ"
MoreResults="លទ្ធផល​ថែម​ទៀត"
WaitSearch="កំពុង​ស្នើ​លទ្ធផល​ស្វែង​រក..."
NoMatch="<div id='dict_result_nomatch' style=\"font-family:'[$TextFont]'; font-size:[$TextFontSize]pt; line-height:normal; padding:10; display:[$Display]\"><b>មិន​មាន​អ្វី​ដែល​ផ្គូ​ផ្គង​ត្រូវ​នឹង \"<font color='#C00000'>[$SearchKey]</font>\" ទេ។</b></div>"

[WebStartPage]
StartPageTpl="<table id='startpage' width='100%' height='100%' border='0' cellspacing='0' cellpadding='10' onselectstart='return false'><tr><td align='center' style=\"font-family: '[$Font]'; font-size: [$FontSize]pt; line-height: 1.2em\"><a href='app://homepage/'><img border='0' src='[$ImgPath]logomain.png' width='134' height='40' style='margin-bottom:50'></a></td></tr></table>"
HelpTip="របៀប​ប្រើ Lingoes"
DownDictTip="ទាញ​យក​វចនានុក្រម​ថែម​ទៀត"
Intro="គាំ​ទ្រ​ការ​បក​ប្រែ​ច្រើន​ជាង​៨០ភាសាទៅ​វិញ​ទៅ​មក<br>ការ​បក​ប្រែ​ដោយ​ប្រើ Cursor ទៅ​ចង្អុល, ការ​បក​ប្រែ​អត្ថបទ និង សរសេរហើយ​អាន"

[TextTranslation]
Title="ការ​បក​ប្រែ​អត្ថបទ"
To="ទៅ​កាន់"
Translate="បក​ប្រែ"
RequestFailed="ការ​ស្នើ​សេវា​បក​ប្រែ​មិន​បាន​សម្រេច​ទេ។"
ConnectFailed="Lingoes មិន​អាច​ភ្ជាប់​ទៅកាន់​ម៉ាស៊ីន​បម្រើ​បាន​ទេ។ ប្រសិន​ជា​អ្នក​ភ្ជាប់​អ៊ីនធើនិត, សួម​ពិនិត្យ​ការ​កំណត់​ការ​ភ្ជាប់​របស់​អ្នក នៅ​ក្នុង​ការ​កំណត់​រូបសណ្ឋាន។ "
WaitRequest="កំពុង​ស្នើ​លទ្ធផល​នៃ​ការ​បក​ប្រែ..."
ParseResultFailed="ការ​វិភាគ​លទ្ធផល​បក​ប្រែ​មិន​បាន​សម្រេច។ ប្រសិន​ជា​អ្នក​បាន​ទទួល​សារ​នេះ ជា​ច្រើន​ដង​នោះ, សូម​រាយការណ៍​មក​យើង។"

; Layout
[Layout]
DictMenu="ម៉ឺនុយ​វចនានុក្រម"
ShowResult="បង្ហាញ​លទ្ធផល"
MinimizeResult="Minimize result"
FindWord="ស្វែង​រក៖ "
NoLicenseTip="Full contents will be shown after authorization...", "This trial version of dictionary is only for evaluation, full contents will be shown after authorization: &nbsp;<a href='app://activate/'><u>Activate</u></a> &nbsp<a href='app://buy/[$ProductID]'><u>Purchase</u></a>", "This trial version of software is only for evaluation, full functions will be available after authorization: &nbsp;<a href='app://activate/'><u>Activate</u></a> &nbsp<a href='app://buy/[$AppProductID]'><u>Purchase</u></a>"
RememberWord="បន្ថែម​ពាក្យ​ទៅ​កាន់សៀវ​ភៅ​ចំណាំ"

; Dictionary Menu
[DictMenu]
About="អំពី..."
Enable="អនុញ្ញាត"
Disable="មិន​អនុញ្ញាត"
DisableMsg="វចនានុក្រម​គឺ​មិន​បាន​បើក​ដំនើរ​ការ​ទេ ហើយ​នឹង​មិន​បង្ហាញ​លទ្ធផល​ផងដែរ!\nអ្នក​អាច​ដំនើរ​ការ​វា​បាន​តាម ផ្ទាំង​គ្រប់​គ្រង\"វចនានុក្រម\"។"
MoveTop="កំណត់​ជា​លទ្ធផល​កំពូល"
ArrangeResults="រៀប​ចំ​លទ្ធផល..."
IndexGroup="  (ក្រុម Index)"
QueryGroup="  (ក្រុម Query)"
GrabGroup="  (ក្រុម Text Capture)"

[Update]
Title="អាប់​ដេត​លើ​បណ្ដាញ"
AskUpgrade="បាន​រក​ឃើញ​កំណែ​ថ្មី។ តើ​អ្នក​ចង់​ធ្វើ​ទំនើប​កម្ម​ទៅ​កាន់​កំណែ​ថ្មី​ទេ?"
UpgradeNow="បាន​រក​ឃើញ​កំណែ​ថ្មី។ ត្រូវ​ការ​ធ្វើ​ទំនើប​កម្ម​ទៅ​កាន់​កំណែ​ថ្មី"
UpdateSuccess="អាប់​ដេត​បាន​សម្រេច!"
UpdateFail="អាប់​ដេត​មិន​បាន​សម្រេច!"
NoUpdate="កំណែ​នា​ពេល​នេះ គឺ​ជា​កំណែ​ចុងក្រោយ​ហើយ"

CheckUpdate="កំពុង​ពិនិត្យ​ការ​អាប់​ដេត..."
GetUpdateInfo="កំពុង​ទទួល​​យក​ព៌តមាន​អាប់​ដេត..."
DownUpdateData="កំពុង​ទាញ​យក​ទិន្នន័យ​អាប់​ដេត..."
ExecUpdate="កំពុង​អាប់​ដេត​ប្រពន័្ធ..."
GetUpgradeInfo="កំពុង​ទទួល​យក​ព៌តមាន​ទំនើប​កម្ម..."
DownUpgradeData="កំពុង​ទាញ​យក​ទិន្នន័យ​ធ្វើ​ទំនើប​កម្ម..."
ExecUpgrade="កំពុង​ធ្វើ​ទំនើប​កម្ម​ប្រពន័្ធ..."
NeedExitForUpgrade="Lingoes នឹង​បិទ​ដើម្បី​បញ្ចប់​ការ​ធ្វើ​ទំនើប​កម្ម"

[Message]
InitUpdateServerFail="Failure to initialization auto update service "
StartDictServerFail="Failure to start dictionary service."

DictFileErr="Incorrect file format!\n[$Filename]"
DictVersinTooOld="[$Filename]\nThe version of current dictionary ([$DictVer]) is too old, please update it.\n\nVisit Lingoes website to search the latest version?"
DictVersinTooNew="[$Filename]\nThe version of current dictionary ([$DictVer]) need higher version of lingoes.\n\nDownload latest version from Lingoes website now?"

AskDictRepeatInstall="The dictionaries list include the dictionary \"[$DictTitle]\",\nDo you wish to continue?"
InstallDictFail="Failure to install dictionary:\n[$Filename]"
AskUninstall="Are you sure you want to uninstall the dictionary?\n\n[$DictTitle]\nID: [$DictID]"
UninstallDictFail="Uninstall dictionary failed\n\n[$DictTitle]\nID: [$DictID]"
AskRemoveFromGroup="Are you sure you want to remove the dictionary \"[$DictTitle]\" in list?"

MemoryAllocFail="Failed to allocate memory."
FilenameInvalid="Invalid file name."
SaveFileFail="Failed to save file"
OpenFileFail="Failed to open file"

AreYouAbort="Are you sure to abort current process?"
CreateThreadFail="Failed to create thread"
CreateEventFail="Failed to create event hand"
Unfulfilment="The feature is unfulfilled"
OnlyProVersion="The feature is only for Pro version."
NoRegister="It's unregistered version, please register Lingoes to use the feature."
UsernameIsEmpty="Username is blank, please fill in again."
SaveSearchResultFail="Failure to save search result."

OpenAppendixFail="Failure to open appendix content.\n\nDownload the appendix from Lingoes website now?"
OpenSpeechEngineFail="Failure to load TTS engine, please check if TTS has installed in your system! \n\nYou must install TTS engine in your operating system to say it. If not, please download it and install it from Lingoes website \n\nDo you want to download it now?"

; NeedIE6Support="Lingoes needs Internet Explorer 6+, please update your web browser to IE6+"
NoImplement="Sorry, the feature is unfulfilled"

InstallSucceed="Install Succeed." 
InstallFailed="Install Failed."

[DlgOptLicense]
Product="License Product"
Enter="Enter License..."
Remove="Remove License", "Removing a license might disable certain product features,\nDo you wish to continue and remove the license for the following products:\n\n[$ProductList]"
Detail="More Details..."

LicenseID="អត្ត​លេខ​អាជ្ញា​បណ្ណ័៖ "
LicenseTo="សិទ្ធិ​អនុញ្ញាត​ចំពោះ៖ "
LicenseExpire="license expire after [$Day] days"
UserLicenseQuantity="[$Quantity] User License", "[$Quantity] User License ([$KeyNo]/[$Quantity])"

[DlgActivation]
Title="បញ្ជូល​អាជ្ញាបណ្ណ័"
ActivateTitle="Enter your license key", "You can find your license key in your purchase confirmation email or on the installation disc holder inside the product package."
LicenseKey="សោរ​អាជ្ញាបណ្ណ័៖"
Name="ឈ្មោះ​របស់​អ្នក៖"
Email="អ៊ីមែល​របស់​អ្នក៖"
NetworkSet="Network Settings", "To activate license key need be online. Please set your proxy server if necessary."
Activate="ដំនើរ​ការ"
BuyTitle="ជាវ​ផលិត​ផល [$Publisher]", "ដើម្បី​ជាវ​ផលិត​ផល [$Publisher], សូម​ចុច​លើ​ប៊ូតុង ជាវ"
Buy="ជាវ"
Cancel="បិទ"

IncorrectProductKey="The license key is incorrect."
IncorrectName="The name is incorrect. Please enter a name within 32 characters"
IncorrectEmail="The email address is incorrect. Please enter a valid email address within 128 characters."
WaitRequest="In process... Please wait."

RequestFailed="The activation is failed. The server might be busy. Please try again later."
NetworkFault="Can't connect activation server, please check your network setting."
ResponseError="Server response data is incorrect."
OtherError="មិន​ស្គាល់​បញ្ហា។"
SaveDataFailed="Save data failed"

ActivateSuccess="ដំនើរ​ការ​បាន​សម្រេច"
ActivateFailed="ដំនើរ​ការ​មិន​បាន​សម្រេច"

[WndTip]
Title="ធីប​តាម​ថ្ងៃ​របស់ Lingoes"
Close="បិទ"
